export const aboutUsText = {
    title: "Бумажный город",
    description: "\"Бумажный город\" - это электронная библиотека, которая была создана в 2012 году с целью предоставить читателям возможность наслаждаться чтением книг \
    в цифровом формате, сохраняя при этом уникальный опыт чтения бумажных книг.\
    В основе концепции \"Бумажного города\" лежит стремление передать атмосферу \
    и чувство, которые возникают при чтении настоящей бумажной книги. Команда разработчиков и дизайнеров уделяла особое внимание деталям, чтобы пользователи могли чувствовать себя так, будто они держат настоящую книгу \
    в своих руках.\
    \nБиблиотека предлагает широкий выбор книг различных жанров и направлений, \
    от классической литературы до современных бестселлеров. Каждая книга \
    в \"Бумажном городе\" проходит тщательный отбор, чтобы обеспечить высокое качество перевода, оформления и макета, делая чтение максимально приятным \
    и комфортным для пользователей."
}