import { Button, Flex } from "antd";
import "./index.css"
import Description from "./Description";

export default function DataBookView() {
    
    const onClick = () => {
        console.log("click view")
    }

    return (
        <Flex className="container-view-book">
            <div className="container-view-img-book">
                <img src="/ProjectImages/Books/test.jpg" />
            </div>
            <Flex className="container-description-view-book"
                  vertical>
                <p className="name">Ход королевы</p>
                <p className="author">Уолтер Тэвис</p>
                <Description text={"Описание описание Описание описание Описание описание Описание описание Описание описание Описание описание Описание описание Описание описание Описание описание \
               \ Описание описание Описание описание Описание описание Описание описание\
               \ писание описание \
              \  Описание описание Описание описание Описание описание Описание описание Описание описание Описание описание Описание описание Описание описание Описание описание \
              \  Описание описание Описание описание Описание описание Описание описание Описание описание Описание описание Описание описание Описание описание Описание описание Описание \
              описание Описание описание Описание описание \
Описание описание Описание описание Описание описание Описание описание Описание описание Описание описание Описание описание Описание описание Описание описание Описание описание Описание описание Описание описание \
Описание описание Описание описание Описание описание Описание описание Описание описание Описание описание Описание описание Описание описание Описание описание Описание описан \
ие Описание описание Описание описание \
Описание описание Описание описание Описание описание Описание описание Описание описание Описание описание Описание описание Описание описание Описание описание Описание описание"
} />
                <p className="type-sub-style">Доступно по крутой подписке</p>
                <Button 
                        onClick={onClick}
                        type="primary" 
                        className="book-view-button">Оформить</Button>
                
            </Flex>
            <Flex className="sub-info-view-book"
                      align="flex-end"
                      justify="right"
                      vertical>
                        <p className="subscribe-type-view-style">Стандарт</p>
                        <img src="/ProjectImages/activeFavourite.png" />
            </Flex>
        </Flex>
    )
}